import matplotlib.pyplot as plt
import numpy as np

# 第一组数据
recall1 = [0.21223,
0.24516,
0.20188,
0.22912,
0.26373,
0.30631,
0.34929,
0.37136,
0.3673,
0.42506,
0.39692,
0.40949,
0.46455,
0.42457,
0.39411,
0.48377,
0.51072,
0.48679,
0.47966,
0.51438,
0.51137,
0.52334,
0.50663,
0.53037,
0.52706,
0.56806,
0.54698,
0.54211,
0.60967,
0.50071,
0.58411,
0.50603,
0.55698,
0.54692,
0.5572,
0.56425,
0.53917,
0.50682,
0.57149,
0.5235,
0.49785,
0.60461,
0.57425,
0.61971,
0.58767,
0.6019,
0.5934,
0.59824,
0.56758,
0.57865,
0.58217,
0.5351,
0.5311,
0.52094,
0.58935,
0.54738,
0.55254,
0.55767,
0.54032,
0.54685
]
precision1 = [0.6144,
0.55334,
0.55577,
0.51408,
0.50678,
0.48018,
0.43291,
0.43959,
0.51176,
0.48541,
0.46671,
0.47068,
0.39044,
0.47987,
0.55864,
0.48667,
0.43287,
0.49096,
0.52432,
0.47702,
0.54151,
0.54066,
0.49109,
0.55453,
0.55432,
0.44782,
0.53996,
0.48937,
0.45871,
0.5683,
0.47953,
0.58384,
0.5228,
0.54322,
0.504,
0.46536,
0.54038,
0.61657,
0.51656,
0.55582,
0.61844,
0.49433,
0.48539,
0.45294,
0.49051,
0.51528,
0.49354,
0.49376,
0.51745,
0.50799,
0.5374,
0.58271,
0.60564,
0.58607,
0.48129,
0.5402,
0.53576,
0.53069,
0.57042,
0.541
]

# # 第二组数据
# recall2 = [0.2, 0.4, 0.6, 0.8, 1.0]
# precision2 = [0.8, 0.6, 0.4, 0.2, 0.0]
# 设置x轴和y轴范围及步长
x_min = 0.2
x_max = 0.6
y_min = 0.4
y_max = 0.6
step = 0.1

# 生成刻度点
x_ticks = np.arange(x_min, x_max + step, step)
y_ticks = np.arange(y_min, y_max + step, step)

# 多项式拟合
degree = 2  # 拟合的多项式阶数
coeffs1 = np.polyfit(recall1, precision1, degree)

# 生成拟合后的曲线
fit_recall1 = np.linspace(min(recall1), max(recall1), 100)
fit_precision1 = np.polyval(coeffs1, fit_recall1)

# 绘制曲线
plt.plot(recall1, precision1, marker='o', label='SiLU')
plt.plot(fit_recall1, fit_precision1, label='Fit Curve 1')
# plt.plot(recall2, precision2, label='Curve 2')

# 设置坐标轴刻度
plt.xticks(x_ticks)
plt.yticks(y_ticks)
# 设置坐标轴和图例
plt.xlabel('Recall')
plt.ylabel('Precision')
plt.title('Precision-Recall Curve')
plt.legend()

# 显示图形
plt.show()
